# Задание: запросить у пользователя имя и вывести сообщение “Привет, {имя}”

name = input("Введите ваше имя: ")
print(f"Привет, {name}")