# Задание: запросить у пользователя число x и вывести x^2

x = int(input("Введите число x: "))
print(x ** 2)