# Задание: запросить длину ребра куба, вывести объем куба, площадь боковой поверхности и площадь одной грани

a = float(input("Введите длину ребра куба: "))
print("Объем куба:", a ** 3)
print("Площадь боковой поверхности:", 4 * a ** 2)
print("Площадь одной грани:", a ** 2)