# Задание: сгенерировать координаты параболы y = x^2 на [-5; 5] с шагом пользователя

step = float(input("Введите шаг: "))

x = -5
while x <= 5:
    y = x ** 2
    y = round(y, 1)
    print(f"({x}, {y})")
    x += step
    x = round(x, 1)